// 正常系テストケース（適用区分：有給休暇）
function test_case_apply_type_yukyu() {
  const e = { 
    namedValues: {
      "タイムスタンプ": ["2026/06/16 13:24:05"],
      "所属": ["BTT事業部"],
      "役職": ["なし"],
      "社員番号": ["BW0054"],
      "氏名": ["松村龍之介"],
      "適用区分": ["有給休暇"],
      "期間（休暇取得開始日）": ["2026-07-01"],
      "期間（休暇取得終了日）": ["2026-07-01"],
      "理由": ["私用の為"],

    }
  };
  onFormSubmit(e);
}


// 正常系テストケース（適用区分：特別休暇）
function test_case_apply_type_tokubetsu() {
  const e = { 
    namedValues: {
      "タイムスタンプ": ["2026/06/16 13:24:05"],
      "所属": ["BTT事業部"],
      "役職": ["なし"],
      "社員番号": ["BW0054"],
      "氏名": ["松村龍之介"],
      "適用区分": ["特別休暇"],
      "期間（休暇取得開始日）": ["2026-07-01"],
      "期間（休暇取得終了日）": ["2026-07-01"],
      "理由": ["私用の為"],

    }
  };
  onFormSubmit(e);
}


// 正常系テストケース（適用区分：振替休暇）
function test_case_apply_type_furikae() {
  const e = { 
    namedValues: {
      "タイムスタンプ": ["2026/06/16 13:24:05"],
      "所属": ["BTT事業部"],
      "役職": ["なし"],
      "社員番号": ["BW0054"],
      "氏名": ["松村龍之介"],
      "適用区分": ["振替休暇"],
      "期間（休暇取得開始日）": ["2026-07-01"],
      "期間（休暇取得終了日）": ["2026-07-01"],
      "理由": ["私用の為"],

    }
  };
  onFormSubmit(e);
}


// 正常系テストケース（適用区分：慶弔休暇）
function test_case_apply_type_keicho() {
  const e = { 
    namedValues: {
      "タイムスタンプ": ["2026/06/16 13:24:05"],
      "所属": ["BTT事業部"],
      "役職": ["なし"],
      "社員番号": ["BW0054"],
      "氏名": ["松村龍之介"],
      "適用区分": ["慶弔休暇"],
      "期間（休暇取得開始日）": ["2026-07-01"],
      "期間（休暇取得終了日）": ["2026-07-01"],
      "理由": ["私用の為"],

    }
  };
  onFormSubmit(e);
}


// 正常系テストケース（有給取得日数：1日）
function test_case_period_1day() {
  const e = { 
    namedValues: {
      "タイムスタンプ": ["2026/06/16 13:24:05"],
      "所属": ["BTT事業部"],
      "役職": ["なし"],
      "社員番号": ["BW0054"],
      "氏名": ["松村龍之介"],
      "適用区分": ["有給休暇"],
      "期間（休暇取得開始日）": ["2026-07-01"],
      "期間（休暇取得終了日）": ["2026-07-01"],
      "理由": ["私用の為"],

    }
  };
  onFormSubmit(e);
}


// 正常系テストケース（有給取得日数：2日）
function test_case_period_2day() {
  const e = { 
    namedValues: {
      "タイムスタンプ": ["2026/06/16 13:24:05"],
      "所属": ["BTT事業部"],
      "役職": ["なし"],
      "社員番号": ["BW0054"],
      "氏名": ["松村龍之介"],
      "適用区分": ["有給休暇"],
      "期間（休暇取得開始日）": ["2026-07-01"],
      "期間（休暇取得終了日）": ["2026-07-02"],
      "理由": ["私用の為"],

    }
  };
  onFormSubmit(e);
}


// 異常系テストケース（休暇取得終了日が休暇取得開始日より前）
function test_case_period_error() {
  const e = { 
    namedValues: {
      "タイムスタンプ": ["2026/06/16 13:24:05"],
      "所属": ["BTT事業部"],
      "役職": ["なし"],
      "社員番号": ["BW0054"],
      "氏名": ["松村龍之介"],
      "適用区分": ["有給休暇"],
      "期間（休暇取得開始日）": ["2026-07-02"],
      "期間（休暇取得終了日）": ["2026-07-01"],
      "理由": ["私用の為"],

    }
  };
  onFormSubmit(e);
}